In [2]:
import sqlite3
import pandas as pd

In [3]:
db_engine = sqlite3.connect('s3_metadata_goes.db')

In [4]:
query = "select * from goes;"
data = pd.read_sql(query, db_engine)

In [9]:
data.tail(300)

         index  Year  Day Hour
847297  847297  2023  035   23
847298  847298  2023  035   23
847299  847299  2023  035   23
847300  847300  2023  035   23
847301  847301  2023  035   23
...        ...   ...  ...  ...
847592  847592  2023  036   00
847593  847593  2023  036   00
847594  847594  2023  036   00
847595  847595  2023  036   00
847596  847596  2023  036   00

[300 rows x 4 columns]